app/controllers/articles_controller.rb

    def index

            @articles = Article.search(params[:search])
---
SELECT "articles".* FROM "articles"

    def show
        if params[:id]
            @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
       # render plain: params[:article].inspect
        @article = Article.new(article_params)


       if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ruby on rails"], ["text", "It's the Framework not a programming language."], ["created_at", "2019-03-20 06:44:16.882948"], ["updated_at", "2019-03-20 06:44:16.882948"]]

    def download_pdf
        #byebug
        article = Article.find(params[:format])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]