environment/blog/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
    def index
        if params[:store]
            @article = Article.find_by(title: "%#{params[:store]}")
        else
            @articles = Article.all

SELECT "articles".* FROM "articles" WHERE "articles"."title" = ?  [["title", "ruby on rails"]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        if params[:store]
            @article = Article.where(title: params[:store])
        elsif params[:id]
            @article = Article.find(params[:id])

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ruby on rails"], ["text", "It's the Framework not a programming language."], ["created_at", "2019-03-20 06:44:16.882948"], ["updated_at", "2019-03-20 06:44:16.882948"]]
---
    def create
       # render plain: params[:article].inspect
        @article = Article.new(article_params)


       if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def download_pdf
        #byebug
        article = Article.find(params[:format])